src/main/resources/xml/accommodationSalesComponentServicePort/shareRooms/shareRooms.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.service.resmanagement.wdw.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ejb:shareRooms>
         <!--Optional:-->
         <request>
            <action>?</action>
            <!--1 or more repetitions:-->
            <shareActionDetails>
               <!--Optional:-->
               <startDate>?</startDate>
               <!--Optional:-->
               <tcGroupId>?</tcGroupId>
               <!--Optional:-->
               <tpsId>?</tpsId>
               <!--Optional:-->
               <tcGroupExternalReference>
                  <!--Optional:-->
                  <externalReferenceType>?</externalReferenceType>
                  <!--Optional:-->
                  <externalReferenceCode>?</externalReferenceCode>
                  <!--Optional:-->
                  <externalReferenceNumber>?</externalReferenceNumber>
                  <!--Optional:-->
                  <externalReferenceSource>?</externalReferenceSource>
               </tcGroupExternalReference>
               <!--Optional:-->
               <tpsExternalReference>
                  <!--Optional:-->
                  <externalReferenceType>?</externalReferenceType>
                  <!--Optional:-->
                  <externalReferenceCode>?</externalReferenceCode>
                  <!--Optional:-->
                  <externalReferenceNumber>?</externalReferenceNumber>
                  <!--Optional:-->
                  <externalReferenceSource>?</externalReferenceSource>
               </tpsExternalReference>
               <!--Optional:-->
               <status>?</status>
            </shareActionDetails>
         </request>
         <!--Optional:-->
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </ejb:shareRooms>
   </soapenv:Body>
</soapenv:Envelope>
